index.org
#+AUTHOR:Oishe Farhan
#+EMAIL:farhanoishe@gmail.com
#+DATE:August 17, 2017
#+TITLE:A Collection of Notes
#+HTML_HEAD: <title>Machine Learning</title> <h1 class="title"> <a href="./index.html">Machine Learning</a></h1>
#+OPTIONS: title:t H:3 num:nil timestamp:nil toc:nil \n:t ::nil |:t ^:{} f:t tex:t
#+OPTIONS: stat:t tags:t todo:nil tasks:nil html-postamble:t <:nil broken-links:mark
#+HTML_MATHJAX: align:center tagside:right font:Neo-Euler
#+BEGIN_CENTER
These are notes I generated from Coursera's [[https://www.coursera.org/learn/machine-learning/][Machine Learning Course]].
The code is written in Matlab/Octave to focus more on the concepts.
#+END_CENTER
* Table of Contents
1. [[./notes/01Introduction.html][Introduction]]
2. [[./notes/02LearningModel.org][Learning Model]]
3. [[./notes/03CostFunction.html][Cost Function]]
4. [[./notes/04GradientDescent.html][Gradient Descent]]
5. [[./notes/05LinearAlgebraReview][Linear Algebra Review]]
* Tools
+ [[https://www.youtube.com/watch?v=SzA2YODtgK4][Emac's Org Mode]] to take notes
+ *[[./tools/OrgTutorial.html][Tutorial]]* for Org Mode and shortcuts
+ *[[./img/LatexSymbols.pdf][Latex]]* for equations
+ [[http://docs.mathjax.org/en/latest/start.html][MathJax]] to display Latex on html
+ [[http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][Exporting]] to html using Org Mode
+ +[[http://pandoc.org/][Pandoc]] to convert to html+
+ +Custom bash script to go from .org to .html+

------
