index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A Collection of Notes</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oishe Farhan" />
<h1 class="titleTOP"> <a href="./index.html">Machine Learning</a></h1>
<link rel="stylesheet" type="text/css" href="./css/style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">A Collection of Notes</h1>
<div class="center">
<p>
These are notes I generated from Coursera's <a href="https://www.coursera.org/learn/machine-learning/">Machine Learning Course</a>.<br  />
The code is written in Matlab/Octave to focus more on the concepts.<br  />
</p>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Table of Contents</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./notes/01Introduction.html">Introduction</a><br  />
</li>
<li><a href="./notes/02LearningModel.html">Learning Model</a><br  />
</li>
<li><a href="./notes/03CostFunction.html">Cost Function</a><br  />
</li>
<li><a href="./notes/04GradientDescent.html">Gradient Descent</a><br  />
</li>
<li><a href="./notes/05LinearAlgebraReview">Linear Algebra Review</a><br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Tools</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=SzA2YODtgK4">Emac's Org Mode</a> to take notes<br  />
</li>
<li><b><a href="./tools/OrgTutorial.html">Tutorial</a></b> for Org Mode and shortcuts<br  />
</li>
<li><b><a href="./img/LatexSymbols.pdf">Latex</a></b> for equations<br  />
</li>
<li><a href="http://docs.mathjax.org/en/latest/start.html">MathJax</a> to display Latex on html<br  />
</li>
<li><a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Exporting</a> to html using Org Mode<br  />
</li>
<li><del><a href="http://pandoc.org/">Pandoc</a> to convert to html</del><br  />
</li>
<li><del>Custom bash script to go from .org to .html</del><br  />
</li>
</ul>

<hr  />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oishe Farhan (<a href="mailto:farhanoishe@gmail.com">farhanoishe@gmail.com</a>)</p>
<p class="date">Date: August 17, 2017</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
